Картриджи/src/Catalogs/ОбслуживаниеПринтеров/ОбслуживаниеПринтеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОбслуживаниеПринтеров</name>
  <owners>Catalog.Подразделения</owners>
  <attributes>
    <name>ДатаРемонта</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКопийОтпечатанныхСтраниц</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьРемонта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Принтер</name>
    <type>
      <types>CatalogRef.Принтера</types>
    </type>
  </attributes>
  <attributes>
    <name>СписокЗамененныхДеталей</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

Картриджи/src/Enums/ВидыДополнительнойИнформацииОбъектов/ВидыДополнительнойИнформацииОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДополнительнойИнформацииОбъектов</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>Файл</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Изображение</name>
    <comment>(Общ)</comment>
  </enumValues>
</mdclass:Enum>

Картриджи/src/Catalogs/Файлы/Файлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Файлы</name>
  <attributes>
    <name>ВидДанных</name>
    <comment>Вид данных</comment>
    <type>
      <types>EnumRef.ВидыДополнительнойИнформацииОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <comment>Имя файла</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектХранилища</name>
    <type>
      <types>CatalogRef.Принтера</types>
      <types>CatalogRef.ОбслуживаниеПринтеров</types>
      <types>CatalogRef.МоделиКартриджей</types>
    </type>
  </attributes>
  <attributes>
    <name>Хранилище</name>
    <comment>Хранилище</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстФайла</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Картриджи/src/Catalogs/ОбслуживаниеПринтеров/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура УстановитьПринтер()

	Объект.Принтер = Неопределено;
	Если ЗначениеЗаполнено(Объект.Владелец) Тогда
		Объект.Принтер = Объект.Владелец.Принтер;	
	КонецЕсли;                                   	

КонецПроцедуры 

&НаКлиенте
Процедура УстановитьВидимость()

	Если Объект.Ссылка.Пустая() Тогда
		Элементы.СтраницаФайлы.Доступность = Ложь;	
	Иначе	
		Элементы.СтраницаФайлы.Доступность = Истина;	
	КонецЕсли; 

	СписокФайлов.Параметры.УстановитьЗначениеПараметра("Объект",Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Объект.ДатаРемонта = ТекущаяДата();
		
		Если ТипЗнч(Параметры.ЗначенияЗаполнения) = Тип("Структура") Тогда
			ЗначенияЗаполнения = Параметры.ЗначенияЗаполнения;
			Если ЗначенияЗаполнения.Свойство("Владелец") Тогда		
				Если ЗначениеЗаполнено(ЗначенияЗаполнения.Владелец) Тогда
					Объект.Принтер = ЗначенияЗаполнения.Владелец.Принтер;		
				КонецЕсли;                                               			
			КонецЕсли;                                        
		КонецЕсли;
		
	КонецЕсли;    
	
КонецПроцедуры
        
&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	УстановитьВидимость();
	
КонецПроцедуры  

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.Наименование = Строка(Объект.Владелец) + " " +Строка(Объект.ДатаРемонта);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокФайловПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("ОбъектХранилища",Объект.Ссылка);
	ЗначенияЗаполнения.Вставить("ВидДанных"      ,ПредопределенноеЗначение("Перечисление.ВидыДополнительнойИнформацииОбъектов.Файл"));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения",ЗначенияЗаполнения);
	
	ОткрытьФорму("Справочник.Файлы.Форма.ФормаЭлемента", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайл(Команда)
	
	ТекущиеДанные = Элементы.СписокФайлов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	РаботаСФайламиКлиент.ОткрытьФайлы(ТекущиеДанные.ИмяФайла, ТекущиеДанные.Ссылка, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	
	УстановитьПринтер();
	
КонецПроцедуры
